/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "obfs4" */
"%1$@ %2$@ makes your traffic appear \"random\"." = "%1$@%2$@تجعل الحركة المرورية تبدو وكأنهّا \"عشوائية\". ";

/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "snowflake" */
"%1$@ %2$@ makes your traffic look like a phone call to a random user on the net." = "%1$@ %2$@ يجعل حركة المرور الخاصة بك تبدو وكأنها مكالمة هاتفية مع مستخدم عشوائي على الشبكة.";

/* BridgesConfViewController */
"Automatic Configuration" = "إعداد تلقائي";

/* BridgeConfViewController */
"Bridge Configuration" = "إعدادات الجسر";

/* BridgeConfViewController; placeholder contains bridge type names: "meek" or "obfs4" */
"Built-in %@" = "%@ المدمج";

/* ScanQrViewController */
"Camera access was not granted or QR Code scanning is not supported by your device." = "لم يتم منح إمكانية الوصول إلى الكاميرا أو لا يدعم جهازكم خاصيّة مسح رمز الإستجابة السريعة.";

/* AlertHelper */
"Cancel" = "ألغِ";

/* CustomBridgesViewController */
"Copy URL to Clipboard" = "نسخ الرابط إلى الحافظة";

/* MoatViewController */
"Couldn't understand server response." = "تعذر فهم استجابة الخادم.";

/* BridgeConfViewController */
"Custom Bridges" = "جسور مخصصة";

/* Transport */
"custom bridges" = "جسور مخصصة";

/* AlertHelper */
"Error" = "خطأ";

/* BridgesConfViewController */
"I'm sure I cannot connect without a bridge." = "أنا متأكد من أنني لا أستطيع الاتصال بدون جسر.";

/* BridgeConfViewController */
"If one type of bridge does not work, try using a different one." = "اذا لم يعمل نوع من الجسور جرب استخدام نوع آخر.";

/* BridgeConfViewController */
"If you are in a country or using a connection that censors Tor, you might need to use bridges." = "اذا كنت فى بلد او تستخدم اتصالا يحجب Tor، فربما ستحتاج استخدام الجسور.";

/* CustomBridgesViewController; placeholder contains "https://bridges.torproject.org/", please visit that page and copy texts for your language! */
"In a separate browser, visit %@ and tap \"Get Bridges\" > \"Just Give Me Bridges!\"" = "قم بزيارة %@ في متصفح مختلف، وانقر على \"احصل على bridges\" > \"فقط أعطني bridges!\"";

/* No comment provided by engineer. */
"Meek bridge" = "Meek bridge";

/* BridgeConfViewController */
"No Bridges" = "لا جسور";

/* ApiError, placeholder is a non-success status from the server. */
"No success, but \"%@\" instead." = "لا نجاح ، ولكن \"%@\" بدلاً من ذلك.";

/* ApiError */
"No valid HTTP response." = "لا توجد استجابة HTTP صالحة.";

/* Transport */
"Obfs4 bridges" = "جسور Obfs4";

/* AlertHelper */
"OK" = "موافق/ة";

/* No comment provided by engineer. */
"On-demand bridges" = "On-demand bridges";

/* CustomBridgesViewController */
"Other" = "آخر";

/* CustomBridgesViewController */
"Paste Bridges" = "لصق الجسور";

/* CustomBridgesViewController; placeholder is "" "https://bridges.torproject.org/" */
"QR Code could not be decoded! Are you sure you scanned a QR code from %@?" = "لا يمكن فك شيفرة رمز الاستجابة السريعة! هل أنتم متأكدون من مسح رمز الاستجابة السريعة من %@؟";

/* BridgeConfViewController */
"Request Bridges from torproject.org" = "طلب الجسور من torproject.org";

/* ApiError */
"Request could not be formed. Please check host and username/password!" = "تعذر تشكيل الطلب. يرجى التحقق من المضيف واسم المستخدم / كلمة المرور!";

/* CustomBridgesViewController */
"Request via E-Mail" = "الطلب عبر البريد الإلكتروني";

/* CustomBridgesViewController */
"Request via Telegram" = "طلب عبر Telegram";

/* ApiError */
"Response body missing." = "نص الاستجابة مفقود.";

/* BridgesConfViewController+Shared */
"Save" = "احفظ";

/* CustomBridgesViewController, ScanQrViewController */
"Scan QR Code" = "مسح رمز QR";

/* Transport */
"Snowflake bridges" = "جسور Snowflake ";

/* Transport */
"Snowflake bridges (AMP rendezvous)" = "جسور Snowflake (موعد AMP)";

/* BridgesConfViewController */
"Try Auto-Configuration" = "جرب الإعداد التلقائي";

/* CustomBridgesViewController */
"Upload QR Code" = "رفع رمز QR";

/* CustomBridgesViewController */
"Use Custom Bridges" = "استخدام جسور مخصصة";

/* CustomBridgesViewController */
"Use QR Code" = "استخدم رمز QR";
